### PART 1: PD SERIES

In [1]:
import pandas as pd
import numpy as np

In [4]:
# make data
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array(mylist)
d = {'a':10,'b':20,'c':30}

In [5]:
#can pass in list
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [6]:
#can pass in array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
# can pass in dictionary?
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
# with labesl 
pd.Series(data=mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
# can be mixed
pd.Series(data=[10,'a',4.4])

0     10
1      a
2    4.4
dtype: object

In [17]:
#using index
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','JAPAN'])

In [18]:
ser1

USA        1
Germany    2
USSR       3
JAPAN      4
dtype: int64

In [19]:
ser1['USA']

1

In [20]:
ser2 = pd.Series([1,2,3,4],index=['USA','Germany','Italy','JAPAN'])

In [25]:
#operations with mult series
# will do based off of the named indexes
ser1 + ser2
# italy is NaN bc NaN + # = NaN (you can change this behavior)
# notice that it converts to floats...

Germany    4.0
Italy      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

### part 2 PD DataFrames

In [26]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [27]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [29]:
df = pd.DataFrame(data=rand_mat)

In [30]:
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [31]:
# need names 
df = pd.DataFrame(data=rand_mat)

In [33]:
df = pd.DataFrame(data=rand_mat, index = 'A B C D E'.split())

In [34]:
df # now the left side is named

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df = pd.DataFrame(data=rand_mat, index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [37]:
df # npow the top is named

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [40]:
mylist = ['W','Y']

In [41]:
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [42]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [45]:
df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
df.drop('NEW', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
# doesn't happen in place 
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [50]:
df.drop('NEW', axis = 1, inplace=True)

In [52]:
df # now it is permanently gone

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
# drop rows (Specify axis)
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
# selecting rows
# .loc ['name']
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [59]:
# Or index
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [61]:
# multiple
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [62]:
# grabing sliced slices
df.loc[['A','B']][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [64]:
# or with comas 
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

### part 3

In [65]:
df >0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [66]:
df[df >0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [68]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [71]:
df[df['W'] > 0]['Y'].loc['A']

0.9079694464765431

In [72]:
cond1 = df['W'] > 0
cond2 = df['Y'] > 1

In [73]:
# and and or do not work in pandas.
# must use & or |
# wrap in () ()

In [74]:
df[(cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.reset_index() # not inplace.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [76]:
# set to index
new_ind = 'CA NY WY OR CO'.split()

In [77]:
df['States'] = new_ind

In [79]:
df.set_index('States', inplace=True) # need to say inplace
# if you want index column to live but not as index make sure that you do reset first

In [81]:
df.describe() #useful info

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [82]:
ser_w = df['W'] > 0 
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

In [84]:
sum(ser_w)

4

### part 4 group by

In [85]:
# split
# grouping and apply
# combine

In [86]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [87]:
df =pd.DataFrame(data)

In [89]:
df.groupby('Company') # need an agrogate function

In [92]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [93]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [91]:
df.groupby('Company').mean() # now it works

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

### part 5 operations

In [94]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head() #duplicates in col2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [95]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [97]:
df['col2'].nunique() # how many uniques

3

In [98]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [99]:
# col 1 >2
# col2 == 444
newdf =  df[(df['col1'] > 2) & (df['col2']==444)]

In [100]:
newdf

   col1  col2 col3
3     4   444  xyz

In [101]:
# can apply functions to cols
def times_two(n):
    return n*2

In [102]:
times_two(3)

6

In [104]:
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [105]:
# create new col with that
df['new'] = df['col1'].apply(times_two)

In [106]:
# with lambda expressions
df['new2'] = df['col1'].apply(lambda x: x**2)

In [108]:
df

   col1  col2 col3  new  new2
0     1   444  abc    2     1
1     2   555  def    4     4
2     3   666  ghi    6     9
3     4   444  xyz    8    16

In [109]:
# permanently delete
# does inplace without specifying
del df['new']
del df['new2']

In [110]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [111]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [113]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [117]:
df.sort_values('col2') # ascending=True by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

###  part 6 data input and output

In [119]:
pwd

'C:\\Users\\dansc\\Coding\\PYTORCH_NOTEBOOKS\\00-Crash-Course-Topics\\01-Crash-Course-Pandas\\DAN DOES IT'

In [121]:
df = pd.read_csv('../example.csv')

In [123]:
newdf = df[['a','b']]

In [124]:
newdf.to_csv('../mynewcsvfile.csv',index = False)

In [125]:
pd.read_excel('../Excel_Sample.xlsx', sheet_name = 'Sheet1')

ImportError: Install xlrd >= 1.0.0 for Excel support